Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
sponse.analyses-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-q3gd41-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-sse4jppfz8-eu5xf3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-sse4jppfz8-m5i90n-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-5pywyj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-sse4jppfz8-cj0t4v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-sse4jppfz8-yhw4hz-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-5pywyj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-sse4jppfz8-5z5zup-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-p8fp4p-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-sse4jppfz8-cj0t4v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-sse4jppfz8-xadyn3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-sse4jppfz8-ix2myj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-q3gd41-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-sse4jppfz8-5z5zup-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-sse4jppfz8-0omln3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-sse4jppfz8-988914-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-sse4jppfz8-0omln3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-sse4jppfz8-7qllhx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-k5ywtx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-sse4jppfz8-hbsf0m-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-sse4jppfz8-988914-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-sse4jppfz8-gwc4y7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-gwxbpd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-sse4jppfz8-yhw4hz-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-sse4jppfz8-gwc4y7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-pjr8lx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-pjr8lx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-p0v24v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-sse4jppfz8-7qllhx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-p0v24v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-sse4jppfz8-m5i90n-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-eylaw8-GET-200]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-49hervuih0-prod]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=EK9X29NIBHFHI]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-gwxbpd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-p8fp4p-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-sse4jppfz8-hbsf0m-GET-200]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=49hervuih0-prod-*/*]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-sse4jppfz8-xx70sd-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=jb3b0u]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-sse4jppfz8-prod]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E20FL5HAUF8L1Y]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=sse4jppfz8-prod-*/*]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=a6381278-82e0-412f-b296-65e14e230d9b]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E2LJ0IIK862SQ0]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=2982019768]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250524134912733100000001]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-d7i405w57f-OPTIONS-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-d7i405w57f-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-d7i405w57f-OPTIONS-200]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Read complete after 1m28s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=7652077732027643493]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=8613266638684832230]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "IZTaK6YFTflZ+/Rpc3tR7AZOBr5ORSpQI02ATqrYuHs=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:05.408+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "A5B+lUOa+ki4fQ9Nd6pu9rQK0Sdf47pABup6zGRO5oJ0McdRMhSSnos+Q8d8qzl9R4EuARRhhnfpFG/7yhSVhQ==" -> "AABZbGDXRL4+lJD9C2b0GZppEgvhUFCU8N6FLZH6WKn+Bh1ZW0UL6cksVhZv1d8fU2nhOwWb1P4Itq13MIRLLg==" # forces replacement
      ~ source_code_size            = 18422771 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "wrwHITudxuGca9Zp4lRdyTbVT0qsZ6rQejBKXwiOYzo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:04.761+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "bLKYJcDsH5n0yhaP1hTt02IVCebukMZ2On4oZnc0jZZkX0hGPwdVLsCMvqkNYFQmWhrA5YlWAnWK2MvcxHddYQ==" -> "hCb2WZ2PJ12+PUyx6s51NA3gbPteVwy2jdgLSZgd1GD41YovssHflTj39cpC14NWr0L7PoyFi6hdX62NU/+CfQ==" # forces replacement
      ~ source_code_size            = 17951217 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "8613266638684832230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "255e3d7902500198d6cc85b54b7e48e23eb7230a" -> "4bb3612d13da7b8309bf03384622b61edd54ce44"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "7652077732027643493" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "255e3d7902500198d6cc85b54b7e48e23eb7230a" -> "4bb3612d13da7b8309bf03384622b61edd54ce44"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7019568072017726227" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072339508000" -> "1748316122659919000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6738116780104036559" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072028128000" -> "1748316123036043800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4257150166791912404" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071433938000" -> "1748316122342854000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "828897542561661082" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071346587800" -> "1748316121631064000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:22cba93ea3afba0596e2d8d94e4d7824dda3d32f73cbbf3e260bb874d242e817127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:22cba93ea3afba0596e2d8d94e4d7824dda3d32f73cbbf3e260bb874d242e817" -> (known after apply)
        name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "044a5a3432974a6c701cc4a7e96b40e1fd2856c7" -> "874646965de5e0a53371ea515b1bd15d8af9ffb6"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "044a5a3432974a6c701cc4a7e96b40e1fd2856c7" -> "874646965de5e0a53371ea515b1bd15d8af9ffb6"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4333101010993935966" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072230688000" -> "1748316122963866000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2774248776896703958" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071446255000" -> "1748316123370815000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6176529677148620091" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072235490000" -> "1748316124741847000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8436155130282382681" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071484670000" -> "1748316123745606800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1687911474222748592" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072463373000" -> "1748316124650843000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3362060528695299874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072348376000" -> "1748316124271401000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4803552922323816431" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071863768200" -> "1748316124257619000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "329662599034451975" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072227954000" -> "1748316123131306800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2819069927824818523" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071972900000" -> "1748316123932216800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "793600866843254176" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071452176000" -> "1748316124448180000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2257836864996758556" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071728066000" -> "1748316124720172000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4847347641194015475" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072375292000" -> "1748316124377717000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "301333099357466849" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071130333000" -> "1748316122248331000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "298668660462482047" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071952931800" -> "1748316124067565000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1514616651873966336" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071870473000" -> "1748316124866153000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2389701127386598120" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071820193000" -> "1748316122348691000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1805263941929168870" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071979314000" -> "1748316124048698000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4108385567130375346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071857618000" -> "1748316124937136000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1126554180938343542" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071425435000" -> "1748316124756649000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4647262764519587137" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071354668000" -> "1748316123639945000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:19:19.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6149282962149294142" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071233004000" -> "1748316122059199000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4" -> (known after apply)
      ~ code_sha256                 = "oLFCCnga6+hreGfcYHe6e7akaGsozoZY7ucc6mKLyqA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:16.525+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/a87a05d15b307a5c088657acbbc432a127d7e2b207f1fc15ea6fa0883bb5afc8.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23517828 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250524134911333700000002/builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "b6ed04166d076b37cf1a0e0b300bae96-5" -> (known after apply)
      ~ id                            = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> (known after apply)
      ~ key                           = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/a87a05d15b307a5c088657acbbc432a127d7e2b207f1fc15ea6fa0883bb5afc8.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/a87a05d15b307a5c088657acbbc432a127d7e2b207f1fc15ea6fa0883bb5afc8.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a87a05d15b307a5c088657acbbc432a127d7e2b207f1fc15ea6fa0883bb5afc8.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a87a05d15b307a5c088657acbbc432a127d7e2b207f1fc15ea6fa0883bb5afc8.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8767329369514517127" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/a87a05d15b307a5c088657acbbc432a127d7e2b207f1fc15ea6fa0883bb5afc8.zip"
          ~ "timestamp" = "1748312081977211000" -> "1748316141754465200"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "256880076051797315" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071368683000" -> "1748316123269999000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3812825530476106348" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071534106000" -> "1748316122069084800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e" -> (known after apply)
        name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "af01671a5c17b463ed7542098f17e9ba058847c5" -> "c7ec6096dc578593eb24ef1c085fedf448ae0772"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "af01671a5c17b463ed7542098f17e9ba058847c5" -> "c7ec6096dc578593eb24ef1c085fedf448ae0772"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:bdd3aec9ef691f50dd33868c209c3a42938da3fc0a18fc3498dbf7de9709773c127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:bdd3aec9ef691f50dd33868c209c3a42938da3fc0a18fc3498dbf7de9709773c" -> (known after apply)
        name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ repo_digest  = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "a875e17d03b7e60525eb88a0e60ed8a2ae7a917e" -> "b94ab98579852bb6d5137149b1e63898924b07c2"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "a875e17d03b7e60525eb88a0e60ed8a2ae7a917e" -> "b94ab98579852bb6d5137149b1e63898924b07c2"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7550213493183711322" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312082050479000" -> "1748316129652524000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:19:10.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:32:20.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6062177119671984176" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312082370538000" -> "1748316129920057000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3545579109924336800" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312082471106000" -> "1748316130948944000"
            # (1 unchanged element hidden)
        }
    }

Plan: 44 to add, 30 to change, 43 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on pgxflow/cloudfront.tf line 45, in resource "aws_cloudfront_distribution" "api_distribution":
│   45:     domain_name = split("/", aws_api_gateway_deployment.PgxApi.invoke_url)[2]
│ 
│ The attribute "invoke_url" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 4 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat02-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat02-plan.out"
✅ Terraform plan created successfully: uat02-plan.out
ℹ️  Plan summary:

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "IZTaK6YFTflZ+/Rpc3tR7AZOBr5ORSpQI02ATqrYuHs=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:05.408+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for uat02!

Thank you for using Atlantis Schema Deploy
© May, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-uat02
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-uat02
  ```
Plan: 44 to add, 30 to change, 43 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```